АлогистикТест2/src/Documents/алк_ВнутренняяПередачаМеждуОрганизациями/алк_ВнутренняяПередачаМеждуОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВнутренняяПередачаМеждуОрганизациями</name>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.алк_ОтгрузкаЩепы</types>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ВыполнениеЗаказовЭтапыСерии/алк_ВыполнениеЗаказовЭтапыСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ВыполнениеЗаказовЭтапыСерии</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контейнер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапВыполненияЗаказа</name>
    <type>
      <types>EnumRef.алк_ЭтапыВыполненияЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ЭтапыВыполненияЗаказов/алк_ЭтапыВыполненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ЭтапыВыполненияЗаказов</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПеревалка</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеТранспортировочнойПартии</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаСудна</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ВнутренняяПередачаМеждуОрганизациями/ManagerModule.bsl
#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВнутренняяПередачаМеждуОрганизациями, СтруктураДополнительныеСвойства) Экспорт
		
		//Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Номенклатура,
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.СерийныйНомер,
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка.ДатаСмены,
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка.Смена,
		//|	&Период,
		//|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.КоличествоПакетов,
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Основание
		//|ИЗ
		//|	Документ.алк_ВнутренняяПередачаМеждуОрганизациями.Запасы КАК алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы
		//|ГДЕ
		//|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка = &Ссылка";
		//
		//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВнутренняяПередачаМеждуОрганизациями);
		//Запрос.УстановитьПараметр("Период", ДокументСсылкаВнутренняяПередачаМеждуОрганизациями.Дата);
		//
		////Запрос.УстановитьПараметр("Период", РфпСервер.ПериодПроведения(ДокументСсылкаРасходнаяНакладная));
		//
		//Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		//Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		//
		//МассивРезультатов = Запрос.ВыполнитьПакет();
		//
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПередачиСобственныеСерии", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПередачи") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПередачи", "Акт передачи", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктПередачи"));
			
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПередачиТД") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПередачиТД", "Акт передачи ТД", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "АктПередачиТД"));
			
		КонецЕсли;
		
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Идентификатор = "АктПередачиТД";
		//КомандаПечати.Представление = НСтр("ru = 'Акт передачи ТД'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 1;
		//
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Идентификатор = "АктПередачи";
		//КомандаПечати.Представление = НСтр("ru = 'Акт передачи'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 2;
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "АктПередачи" Тогда
				
				СформироватьАктПередачи(ТабличныйДокумент, ТекущийДокумент, ИмяМакета);
				
			ИначеЕсли ИмяМакета = "АктПередачиТД" Тогда
				
				СформироватьАктПередачи(ТабличныйДокумент, ТекущийДокумент, ИмяМакета);
				
			КонецЕсли;
			
		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Процедура формирования Акта передачи
	//
	Процедура СформироватьАктПередачи(ТабличныйДокумент, ТекущийДокумент, ИмяМакета)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		ЗапросТекст =
		"ВЫБРАТЬ
		|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.СерийныйНомер) КАК КоличествоПакетов,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА 0
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Длина
		|	КОНЕЦ КАК Длина,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА 0
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Сечение
		|	КОНЕЦ КАК Сечение,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА """"
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Влажность
		|	КОНЕЦ КАК Влажность,
		|	СУММА(ВЫБОР
		|			КОГДА алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Номенклатура = &ШпонКусковой
		|				ТОГДА алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня
		|			ИНАЧЕ алк_ПараметрыПакетовСрезПоследних.Объем
		|		КОНЕЦ) КАК Объем,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор КАК ДокументТранспортировки,
		|	ВЫБОР
		|		КОГДА алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Основание ССЫЛКА Документ.алк_РасходнаяНакладная
		|			ТОГДА ВЫБОР
		|					КОГДА алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор ЕСТЬ NULL
		|						ТОГДА """"
		|					ИНАЧЕ ВЫРАЗИТЬ(алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор КАК Документ.алк_ТранспортировкаЗапасов).НомерНакладной
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТранспортировкаНомер,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор.ИдентификаторТС КАК ИдентификаторТС,
		|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка КАК Регистратор,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор.ЛогистическийЦентрПолучатель КАК ЛогистическийЦентрПолучатель,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА """"
		|		ИНАЧЕ алк_ВыполнениеЗаказовЭтапыСерииОбороты.ЗаказПокупателя
		|	КОНЕЦ КАК ЗаказПокупателя,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC КАК Сертификат,
		|	&ДатаДокумента КАК ДатаДокумента
		|ИЗ
		|	Документ.алк_ВнутренняяПередачаМеждуОрганизациями.Запасы КАК алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ВыполнениеЗаказовЭтапыСерии.Обороты(, , Регистратор, ЭтапВыполненияЗаказа = ЗНАЧЕНИЕ(Перечисление.алк_ЭтапыВыполненияЗаказов.Отгрузка)) КАК алк_ВыполнениеЗаказовЭтапыСерииОбороты
		|		ПО алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.СерийныйНомер = алк_ВыполнениеЗаказовЭтапыСерииОбороты.СерийныйНомер
		|ГДЕ
		|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыХарактеристик.Сорт,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА 0
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Длина
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА 0
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Сечение
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА """"
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Влажность
		|	КОНЕЦ,
		|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Номенклатура,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор,
		|	ВЫБОР
		|		КОГДА алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Основание ССЫЛКА Документ.алк_РасходнаяНакладная
		|			ТОГДА ВЫБОР
		|					КОГДА алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор ЕСТЬ NULL
		|						ТОГДА """"
		|					ИНАЧЕ ВЫРАЗИТЬ(алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор КАК Документ.алк_ТранспортировкаЗапасов).НомерНакладной
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор.ИдентификаторТС,
		|	алк_ВнутренняяПередачаМеждуОрганизациямиЗапасы.Ссылка,
		|	алк_ВыполнениеЗаказовЭтапыСерииОбороты.Регистратор.ЛогистическийЦентрПолучатель,
		|	ВЫБОР
		|		КОГДА &ИмяМакета = ""АктПередачиТД""
		|			ТОГДА """"
		|		ИНАЧЕ алк_ВыполнениеЗаказовЭтапыСерииОбороты.ЗаказПокупателя
		|	КОНЕЦ,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыХарактеристик.Порода
		|ИТОГИ
		|	СУММА(КоличествоПакетов),
		|	СУММА(Объем)
		|ПО
		|	ОБЩИЕ,
		|	Номенклатура,
		|	ДокументТранспортировки";
		
		
		Запрос.Текст = ЗапросТекст;
		
		Запрос.УстановитьПараметр("Регистратор", ТекущийДокумент.Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента", ТекущийДокумент.Дата);
		Запрос.УстановитьПараметр("ШпонКусковой", Справочники.Номенклатура.НайтиПоНаименованию("Шпон кусковой"));
		//Запрос.УстановитьПараметр("Щепа", Справочники.Номенклатура.НайтиПоНаименованию("Щепа"));
		Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ВнутренняяПередачаМеждуОрганизациями."+ИмяМакета);	
		
		ОбластьТранспортировка  = Макет.ПолучитьОбласть("СтрокаИтогиТранспортировка");
		Если ИмяМакета = "АктПередачиТД" Тогда
			ОбластьТранспортировка1 = Макет.ПолучитьОбласть("СтрокаИтогиТранспортировка1");
			ОбластьТранспортировка2 = Макет.ПолучитьОбласть("СтрокаИтогиТранспортировка2");
		КонецЕсли;
		
		СуммаОбъемСертификат = 0;
		СуммаКолвоСертификат = 0;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Приложение");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьМакета.Параметры.НомерДокумента = ТекущийДокумент.Номер;
		ОбластьМакета.Параметры.ДатаДокумента = Формат(ТекущийДокумент.Дата, "ДЛФ=D");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		РезултатЗапроса = Запрос.Выполнить(); //  РезултатЗапроса.Выгрузить()
		
		ВыборкаОбщийИтог = РезултатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); ВыборкаОбщийИтог.Следующий();
		
		НомерСтроки = 1;
		
		ВыборкаНоменклатура = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ВыборкаТранспортировка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТранспортировка.Следующий() Цикл
				
				_СуммаОбъемСертификат = 0;
				_СуммаКолвоСертификат = 0;
				
				ВДЗ = ВыборкаТранспортировка.Выбрать();
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДетали");
				
				Пока ВДЗ.Следующий() Цикл
					
					ОбластьМакета.Параметры.Заполнить(ВДЗ);
					ОбластьМакета.Параметры.Сертификат = ?(ВДЗ.Сертификат, "FSC 100%", "Несертиф.");
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
					
					СуммаОбъемСертификат = СуммаОбъемСертификат + ?(ВДЗ.Сертификат, ВДЗ.Объем, 0);
					СуммаКолвоСертификат = СуммаКолвоСертификат + ?(ВДЗ.Сертификат, ВДЗ.КоличествоПакетов, 0);
					
					_СуммаОбъемСертификат = _СуммаОбъемСертификат + ?(ВДЗ.Сертификат, ВДЗ.Объем, 0);
					_СуммаКолвоСертификат = _СуммаКолвоСертификат + ?(ВДЗ.Сертификат, ВДЗ.КоличествоПакетов, 0);
					
				КонецЦикла; 
				
				
				ОбластьТранспортировкаПараметры = Новый Структура("СтрокаТранспортировка,КоличествоПакетовСертификат,ОбъемСертификат,КоличествоПакетовН,ОбъемН,Объем,Сертификат");
				ОбластьТранспортировкаПараметры.СтрокаТранспортировка = "Итого по: " + ВыборкаТранспортировка.ДокументТранспортировки;
				ОбластьТранспортировкаПараметры.КоличествоПакетовСертификат = _СуммаКолвоСертификат;
				ОбластьТранспортировкаПараметры.ОбъемСертификат = _СуммаОбъемСертификат;
				ОбластьТранспортировкаПараметры.КоличествоПакетовН = ВыборкаТранспортировка.КоличествоПакетов - _СуммаКолвоСертификат;
				ОбластьТранспортировкаПараметры.ОбъемН = ВыборкаТранспортировка.Объем - _СуммаОбъемСертификат;
				
				Если ИмяМакета = "АктПередачиТД" Тогда
					Если ОбластьТранспортировкаПараметры.ОбъемСертификат <> 0 и ОбластьТранспортировкаПараметры.ОбъемН <> 0 Тогда
						ОбластьТранспортировка = ОбластьТранспортировка2;	
					ИначеЕсли ОбластьТранспортировкаПараметры.ОбъемСертификат <> 0 Тогда
						ОбластьТранспортировка = ОбластьТранспортировка1;	
						ОбластьТранспортировкаПараметры.Сертификат = "FSC 100%";
						ОбластьТранспортировкаПараметры.Объем = ОбластьТранспортировкаПараметры.ОбъемСертификат;
					Иначе		//Если ОбластьТранспортировкаПараметры.ОбъемН <> 0 Тогда
						ОбластьТранспортировка = ОбластьТранспортировка1;	
						ОбластьТранспортировкаПараметры.Сертификат = "Несертифицированный";
						ОбластьТранспортировкаПараметры.Объем = ОбластьТранспортировкаПараметры.ОбъемН;
					КонецЕсли;
				КонецЕсли;
				

				ОбластьТранспортировка.Параметры.Заполнить(ВыборкаТранспортировка);
				ОбластьТранспортировка.Параметры.Заполнить(ОбластьТранспортировкаПараметры);
				ТабличныйДокумент.Вывести(ОбластьТранспортировка);
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		Если СуммаОбъемСертификат <> 0 Тогда
			ОбластьПИтог = Макет.ПолучитьОбласть("СтрокаПИтоги");
			ОбластьПИтогПараметры = новый структура("СтрокаСертификат,КоличествоПакетов,Объем");
			ОбластьПИтогПараметры.СтрокаСертификат = "FSC 100% SGS-COC-009744";
			ОбластьПИтогПараметры.КоличествоПакетов = СуммаКолвоСертификат;
			ОбластьПИтогПараметры.Объем = СуммаОбъемСертификат;
			ОбластьПИтог.Параметры.Заполнить(ОбластьПИтогПараметры);
			ТабличныйДокумент.Вывести(ОбластьПИтог);
		КонецЕсли; 
		
		Если (ВыборкаОбщийИтог.КоличествоПакетов - СуммаКолвоСертификат) <> 0 Тогда
			ОбластьПИтог = Макет.ПолучитьОбласть("СтрокаПИтоги");
			ОбластьПИтогПараметры = новый структура("СтрокаСертификат,КоличествоПакетов,Объем");
			ОбластьПИтогПараметры.СтрокаСертификат = "Без сертификата";
			ОбластьПИтогПараметры.КоличествоПакетов = ВыборкаОбщийИтог.КоличествоПакетов - СуммаКолвоСертификат;
			ОбластьПИтогПараметры.Объем = ВыборкаОбщийИтог.Объем - СуммаОбъемСертификат;
			ОбластьПИтог.Параметры.Заполнить(ОбластьПИтогПараметры);
			ТабличныйДокумент.Вывести(ОбластьПИтог);
		КонецЕсли; 
		
		ОбластьИтог = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабличныйДокумент.Вывести(ОбластьИтог);
		
		ОбластьДокумента = Макет.ПолучитьОбласть("Подписанты");
		ОбластьДокумента.Параметры.Продавец = "Сурова О.Г. По дов.  № АЛК-1238/2021 от 30.12.2021 ";
		ОбластьДокумента.Параметры.Покупатель = "Подосенов С.В По дов. № ТД-1391/2017 от 08.06.2017";
		ТабличныйДокумент.Вывести(ОбластьДокумента);

		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
	КонецПроцедуры //СформироватьАктПередачи
	
	#КонецОбласти
